stage0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-02 Sun 00:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Raspberry Pi Baremetal Language Bootstrapping</title>
<meta name="author" content="Robert Kovacsics (rmk35)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Raspberry Pi Baremetal Language Bootstrapping</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfe09827">1. <span class="todo TODO">TODO</span> Forth</a>
<ul>
<li><a href="#orgefff210">1.1. Assumptions</a></li>
<li><a href="#org1dfc56e">1.2. Notation</a></li>
<li><a href="#org7b6e506">1.3. <span class="todo TODO">TODO</span> Dictionary-list</a>
<ul>
<li><a href="#orgb2e6b09">1.3.1. <span class="todo TODO">TODO</span> FDEF</a></li>
<li><a href="#org913d7f1">1.3.2. <span class="todo TODO">TODO</span> Simple helper words</a></li>
<li><a href="#orga4e3707">1.3.3. <span class="todo TODO">TODO</span> Creation</a></li>
<li><a href="#org77419f7">1.3.4. <span class="todo TODO">TODO</span> Lookup</a></li>
<li><a href="#orgd264f7e">1.3.5. <span class="todo TODO">TODO</span> Memory comparison</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5a146cd">2. <span class="todo TODO">TODO</span> Testing</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfe09827" class="outline-2">
<h2 id="orgfe09827"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> Forth</h2>
<div class="outline-text-2" id="text-1">
<p>
Do .weak?
</p>
</div>
<div id="outline-container-orgefff210" class="outline-3">
<h3 id="orgefff210"><span class="section-number-3">1.1.</span> Assumptions</h3>
</div>
<div id="outline-container-org1dfc56e" class="outline-3">
<h3 id="org1dfc56e"><span class="section-number-3">1.2.</span> Notation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
From <a href="https://forth-standard.org/standard/usage">https://forth-standard.org/standard/usage</a>
</p>
<ul class="org-ul">
<li><code>c-addr</code> is a character aligned address</li>
<li><code>c-addr u</code> refers to a string</li>
</ul>
</div>
</div>
<div id="outline-container-org7b6e506" class="outline-3">
<h3 id="org7b6e506"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> Dictionary-list</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgb2e6b09" class="outline-4">
<h4 id="orgb2e6b09"><span class="section-number-4">1.3.1.</span> <span class="todo TODO">TODO</span> FDEF</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.macro</span> .fdef1 name:req, label, imm, hidden, rest:vararg
  <span style="font-weight: bold;">.entry</span> \name, \label, \imm, \hidden
  <span style="font-weight: bold;">.forth_interpreter</span>
  <span style="font-weight: bold;">.ifnb</span> \rest <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">.fw \rest ; .endif</span>
<span style="font-weight: bold;">.endm</span>
<span style="font-weight: bold;">.macro</span> .fdef name:req, label, rest:vararg
  <span style="font-weight: bold;">.fdef1</span> \name, \label, 0, 0, \rest
<span style="font-weight: bold;">.endm</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org913d7f1" class="outline-4">
<h4 id="org913d7f1"><span class="section-number-4">1.3.2.</span> <span class="todo TODO">TODO</span> Simple helper words<a id="org794179c"></a></h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"1-"</span>, DECR, LIT, L,1, SUB, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"1+"</span>, INCR, LIT, L,1, ADD, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"2DUP"</span>, TWO_DUP, OVER, OVER, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"2DROP"</span>, TWO_DROP, DROP, DROP, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"-ROT"</span>, NROT, ROT, ROT, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"2&gt;R"</span>, TWO_TO_R, R_FROM, NROT, SWAP
<span style="font-weight: bold;">.fw</span> TO_R, TO_R, TO_R, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"2R&gt;"</span>, TWO_R_FROM, R_FROM, R_FROM
<span style="font-weight: bold;">.fw</span> R_FROM, ROT, TO_R, SWAP, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"2RDROP"</span>, TWO_R_DROP, R_FROM, R_FROM
<span style="font-weight: bold;">.fw</span> R_FROM, TWO_DROP, TO_R, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"2R\x40"</span>, TWO_R_FETCH, R_FROM
<span style="font-weight: bold;">.fw</span> TWO_R_FROM, TWO_DUP, TWO_TO_R, ROT
<span style="font-weight: bold;">.fw</span> TO_R, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"TRUE"</span>, _, LIT, L,-1, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"FALSE"</span>, _, LIT, L,0, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"HERE_VAR"</span>, _, LIT, L,HERE_LOC, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"LATEST"</span>, _, LIT, L,LATEST_LOC, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"STATE"</span>, _, LIT, L,STATE_LOC, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"HERE"</span>, _, HERE_VAR, FETCH, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"CHAR+"</span>, CHAR_ADD, CHAR_SIZE, ADD, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"CELL+"</span>, CELL_ADD, CELL_SIZE, ADD, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"CHARS"</span>, _, CHAR_SIZE, STAR, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"CELLS"</span>, _, CELL_SIZE, STAR, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"C\x2c"</span>, C_COMMA, HERE, C_STORE, HERE
<span style="font-weight: bold;">.fw</span> CHAR_ADD, HERE_VAR, STORE, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"\x2c"</span>, COMMA, HERE, STORE, HERE
<span style="font-weight: bold;">.fw</span> CELL_ADD, HERE_VAR, STORE, EXIT
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4e3707" class="outline-4">
<h4 id="orga4e3707"><span class="section-number-4">1.3.3.</span> <span class="todo TODO">TODO</span> Creation</h4>
<div class="outline-text-4" id="text-1-3-3">
<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"ALLOT"</span>, _
  <span style="font-weight: bold;">.fw</span> HERE, ADD, HERE_VAR, STORE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: ALLOT HERE + HERE_VAR ! ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"ALIGN"</span>, _
  <span style="font-weight: bold;">.fw</span> HERE, CELL_SIZE, DECR, ADD
  <span style="font-weight: bold;">.fw</span> CELL_SIZE, DECR, INVERT, AND
  <span style="font-weight: bold;">.fw</span> HERE_VAR, STORE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: ALIGN
  HERE cell-size 1- + cell-size 1-  invert and
  HERE_VAR ! ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"CREATE"</span>, _
  <span style="font-weight: bold;">.fw</span> ALIGN
  <span style="font-weight: bold;">.fw</span> HERE, LATEST, FETCH
  <span style="font-weight: bold;">.fw</span> COMMA, LATEST, STORE
  <span style="font-weight: bold;">.fw</span> LIT, L,0, C_COMMA
  <span style="font-weight: bold;">.fw</span> LIT, L,0, C_COMMA, ALIGN
  <span style="font-weight: bold;">.fw</span> BL, WORD
  <span style="font-weight: bold;">.fw</span> CELL_SIZE, ALLOT
  <span style="font-weight: bold;">.fw</span> FETCH, CHARS, ALLOT
  <span style="font-weight: bold;">.fw</span> LIT, L,0, C_COMMA
  <span style="font-weight: bold;">.fw</span> EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: CREATE ( "&lt;spaces&gt;name" -- )
  align
  here latest @ , latest !
  0 C, 0 C, align \ flags
  bl word \ c-str
  cell-size allot \ allot space for len
  @ chars allot \ allot len characters
  0 C, \ For C string compatibility
  align ; \ padding
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"BALIGN"</span>, BALIGN, DECR, SWAP, OVER
<span style="font-weight: bold;">.fw</span> ADD, SWAP, INVERT, AND, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"ENTRY-NEXT"</span>, ENTRY_NEXT, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"ENTRY-FLAGS"</span>, ENTRY_FLAGS, CELL_ADD, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"ENTRY-LEN"</span>, ENTRY_LEN, LIT, L,2
<span style="font-weight: bold;">.fw</span> CELLS, ADD, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"ENTRY-CHARS"</span>, ENTRY_CHARS, LIT, L,3
<span style="font-weight: bold;">.fw</span> CELLS, ADD, EXIT
<span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"ENTRY-XT"</span>, ENTRY_XT, DUP
<span style="font-weight: bold;">.fw</span> ENTRY_LEN, FETCH, LIT, L,1, ADD, SWAP
<span style="font-weight: bold;">.fw</span> ENTRY_CHARS, ADD, LIT, L,4, BALIGN, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">TODO
</pre>
</div>
</td></tr></tbody></table>



<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"HIDDEN?"</span>, HIDDENP
  <span style="font-weight: bold;">.fw</span> ENTRY_FLAGS, C_FETCH, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: HIDDEN? entry-flags C@ ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"IMMEDIATE?"</span>, IMMEDIATEP
  <span style="font-weight: bold;">.fw</span> ENTRY_FLAGS, CHAR_ADD, C_FETCH, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: IMMEDIATE? ( xt -- -1|0 )
  entry-flags char+ C@ ;
</pre>
</div>
</td></tr></tbody></table>

<p>
Toggles hidden status of a given xt
</p>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"HIDE"</span>, _, CELL_ADD, DUP, C_FETCH
  <span style="font-weight: bold;">.fw</span> INVERT, SWAP, C_STORE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: HIDE ( xt -- )
  cell+ dup C@
  invert swap C! ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef1</span> <span style="font-style: italic;">"IMMEDIATE"</span>, _, -1 <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">immediate */</span>
  <span style="font-weight: bold;">.fw</span> LATEST, FETCH
  <span style="font-weight: bold;">.fw</span> TRUE, SWAP, CELL_ADD, CHAR_ADD, C_STORE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: IMMEDIATE ( -- )
  LATEST @
  true swap cell+ char+ C!
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>

<div id="outline-container-org77419f7" class="outline-4">
<h4 id="org77419f7"><span class="section-number-4">1.3.4.</span> <span class="todo TODO">TODO</span> Lookup</h4>
<div class="outline-text-4" id="text-1-3-4">
<dl class="org-dl">
<dt>TODO</dt><dd>Explain "c-addr u" and fwsize</dd>
</dl>


<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"FIND\x27"</span>, FIND_NEW
  <span style="font-weight: bold;">.fw</span> LATEST, FETCH
<span style="font-weight: bold;">FIND_LOOP</span>: <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">( c-addr u entry ) */</span>
  <span style="font-weight: bold;">.fw</span> DUP, LIT, L,0, EQUAL, ZBRANCH, L,(FIND_NON_END-.)
  <span style="font-weight: bold;">.fw</span> DROP, DROP, LIT, L,0, EXIT
<span style="font-weight: bold;">FIND_NON_END</span>:
  <span style="font-weight: bold;">.fw</span> DUP, HIDDENP, INVERT
  <span style="font-weight: bold;">.fw</span> ZBRANCH, L,(FIND_NEXT_ENTRY-.)

  <span style="font-weight: bold;">.fw</span> TWO_DUP, ENTRY_LEN, FETCH, EQUAL
  <span style="font-weight: bold;">.fw</span> ZBRANCH, L,(FIND_NEXT_ENTRY-.)
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">c-addr u entry */</span>
  <span style="font-weight: bold;">.fw</span> TWO_DUP, ENTRY_CHARS
  <span style="font-weight: bold;">.fw</span> LIT, L,4, PICK
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">c-addr u entry u entry-str c-addr */</span>
  <span style="font-weight: bold;">.fw</span> MEMCMP, ZBRANCH, L,(FIND_NEXT_ENTRY-.)

  <span style="font-weight: bold;">.fw</span> NIP, NIP
  <span style="font-weight: bold;">.fw</span> DUP, ENTRY_XT
  <span style="font-weight: bold;">.fw</span> SWAP, IMMEDIATEP
  <span style="font-weight: bold;">.fw</span> ZBRANCH, L,(NON_IMM-.), LIT, L,1, BRANCH, L,(IMM_END-.)
<span style="font-weight: bold;">NON_IMM</span>:
  <span style="font-weight: bold;">.fw</span> LIT, L,-1
<span style="font-weight: bold;">IMM_END</span>:
  <span style="font-weight: bold;">.fw</span> EXIT

<span style="font-weight: bold;">FIND_NEXT_ENTRY</span>:
  <span style="font-weight: bold;">.fw</span> FETCH
  <span style="font-weight: bold;">.fw</span> BRANCH, L,(FIND_LOOP-.)
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: FIND' ( c-addr u -- c-addr 0 | xt 1 | xt -1 )
  latest @
  begin \ c-addr u entry
    dup 0 = if drop drop 0 exit then
    dup hidden? invert if
      2dup entry-len = if \ c-addr u entry entry-len u
	2dup entry-chars 4 pick
	\ c-addr u entry u entry-str c-addr
	memcmp if \ c-addr u entry
	  nip nip \ entry
	  dup entry-xt
	  swap immediate? if 1 else -1 then
	  exit
	then
      then
    then
    @ \ Fetch next entry
  again ;
</pre>
</div>
</td></tr></tbody></table>

<p>
We also need to write the memory comparison, as well as the utilities
for the flags.
</p>
</div>
</div>

<div id="outline-container-orgd264f7e" class="outline-4">
<h4 id="orgd264f7e"><span class="section-number-4">1.3.5.</span> <span class="todo TODO">TODO</span> Memory comparison</h4>
<div class="outline-text-4" id="text-1-3-5">
<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span style="font-weight: bold;">.fdef</span> <span style="font-style: italic;">"MEMCMP"</span>, _
  <span style="font-weight: bold;">.fw</span> ROT, LIT, L,0
  <span style="font-weight: bold;">.fw</span> TWO_TO_R
<span style="font-weight: bold;">MEMCMP_LOOP</span>:
  <span style="font-weight: bold;">.fw</span> TWO_DUP, R_FETCH, ADD, C_FETCH
  <span style="font-weight: bold;">.fw</span> SWAP, R_FETCH, ADD, C_FETCH

  <span style="font-weight: bold;">.fw</span> CHAR_EQUAL, INVERT, ZBRANCH, L,(MEMCMP_NEXT-.)
  <span style="font-weight: bold;">.fw</span> TWO_R_DROP, TWO_DROP, FALSE, EXIT
<span style="font-weight: bold;">MEMCMP_NEXT</span>:
  <span style="font-weight: bold;">.fw</span> R_FROM, LIT, L,1, ADD, TO_R
  <span style="font-weight: bold;">.fw</span> TWO_R_FETCH, EQUAL
  <span style="font-weight: bold;">.fw</span> ZBRANCH, L,(MEMCMP_LOOP-.)
  <span style="font-weight: bold;">.fw</span> TWO_R_DROP

  <span style="font-weight: bold;">.fw</span> TWO_DROP, TRUE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: MEMCMP ( len a b -- true | false )
  rot 0 do
    2dup i + C@ swap i + C@
    char= invert if unloop 2drop false exit then
  loop
  2drop true ;
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>
</div>
</div>


<div id="outline-container-org5a146cd" class="outline-2">
<h2 id="org5a146cd"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Testing</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>SOURCE-ID</code></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert Kovacsics (rmk35)</p>
<p class="date">Created: 2022-01-02 Sun 00:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
